Repository: 84000/data-translation-memory
Catalog: toh219-v3.tmx
Source language: bo
Languages: en

source: གཟུང་བ་མ་མཆིས་པས་སེམས་ཅན་ཐམས་ཅད་ལ་སྩལ་ཏོ། །ཇི་ལྟར་དགེ་བའི་རྩ་བ་རྣམས་སེམས་ཅན་ཐམས་ཅད་ལ་གཏང་བར་བགྱི་བ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཆགས་པ་མི་མངའ་བས་ཇི་ལྟར་མཁྱེན་པ་དེ་ལྟ་བུས་བདག་གིས་དགེ་བའི་རྩ་བ་དེ་གཏང་ངོ་།
en: “ ‘Just as the buddha bhagavats, with the unimpeded wisdom of buddhahood, know their giving of the roots of merit to all beings, I give the roots of merit in the same way.

source: སེམས་ཅན་ཐམས་ཅད་ལག་ན་རིན་པོ་ཆེ་དང་ལྡན་པར་གྱུར་ཅིག །ནམ་མཁའི་མཛོད་དང་ལོངས་སྤྱོད་ཟད་མི་ཤེས་པ་དང་། བསོད་ནམས་ཟད་མི་ཤེས་པ་དང་།
en: “ ‘May all beings have jewels in their hands.

source: ཆོས་ཟད་མི་ཤེས་པ་དང་། ཡེ་ཤེས་ཟད་མི་ཤེས་པ་དང་། སྤོབས་པ་ཟད་མི་ཤེས་པ་དང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པ་དང་། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཐོབ་པར་གྱུར་ཅིག །
en: May they attain the treasury of space, enjoyment that knows no end, merit that knows no end, Dharma that knows no end, knowledge that knows no end, eloquence that knows no end, the highest, most complete enlightenment of buddhahood, and omniscient wisdom.

source: བདག་གི་དགེ་བའི་རྩ་བ་སེམས་ཅན་ཐམས་ཅད་ལ་སྩལ་བ་ལས་བྱུང་བའི་བསོད་ནམས་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་གཅིག་ཏུ་བསྡུས་གཞལ་བཟླུམས་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོའོ། །
en: “ ‘I combine into one and unify whatever merit arises from my bestowing the roots of merit on all beings, and I dedicate it to the highest, most complete enlightenment.

source: དགེ་བའི་རྩ་བ་འདིས་བདག་དང་སེམས་ཅན་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་གྱུར་ཅིག །ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱང་ཐོབ་པར་གྱུར་ཅིག །
en: “ ‘Through this root of merit may I and all beings attain the highest, most complete enlightenment of buddhahood and may we attain omniscient wisdom.

source: ཇི་ལྟར་སྔོན་གྱི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་གིས་བྱང་ཆུབ་ཀྱི་ཕྱིར་སྤྱོད་པ་ན་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འགྱུར་བར་བགྱི་བའི་སླད་དུ་དགེ་བའི་རྩ་བ་རྣམས་ཡོངས་སུ་བསྔོས་པ་དེ་བཞིན་དུ་བདག་གིས་ཀྱང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འགྱུར་བར་བགྱི་བའི་སླད་དུ་དགེ་བའི་རྩ་བ་རྣམས་ཡོངས་སུ་བསྔོའོ། །
en: “ ‘Just as the bodhisattva mahāsattvas of the past, practicing for the sake of enlightenment, dedicated their roots of merit for the sake of omniscience, in that same way I also dedicate my roots of merit for the sake of omniscience.

source: ཇི་ལྟར་མ་འོངས་པའི་དུས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་བྱང་ཆུབ་ཀྱི་ཕྱིར་སྤྱོད་པ་ན་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འགྱུར་བར་བགྱི་བའི་སླད་དུ་དགེ་བའི་རྩ་བ་རྣམས་ཡོངས་སུ་སྔོ་བར་འགྱུར་བ་དེ་བཞིན་དུ་བདག་གིས་ཀྱང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འགྱུར་བར་བགྱི་བའི་སླད་དུ་དགེ་བའི་རྩ་བ་རྣམས་ཡོངས་སུ་བསྔོའོ། །
en: “ ‘Just as the bodhisattva mahāsattvas of the future, practicing for the sake of enlightenment, will dedicate their roots of merit for the sake of omniscience, in that same way I also will dedicate my roots of merit for the sake of omniscience.

source: ཇི་ལྟར་དེ་ལྟ་ན་ད་ལྟར་བྱུང་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ཀྱང་བྱང་ཆུབ་ཀྱི་ཕྱིར་སྤྱོད་པ་ན་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འགྱུར་བར་བགྱི་བའི་སླད་དུ་དགེ་བའི་རྩ་བ་རྣམས་ཡོངས་སུ་སྔོ་བ་དེ་བཞིན་དུ་བདག་གིས་ཀྱང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འགྱུར་བར་བགྱི་བའི་སླད་དུ་དགེ་བའི་རྩ་བ་རྣམས་ཡོངས་སུ་བསྔོའོ། །
en: “ ‘Just as the bodhisattva mahāsattvas of the present, practicing for the sake of enlightenment, dedicate their roots of merit for the sake of omniscience, in that same way I also dedicate my roots of merit for the sake of omniscience.

source: དགེ་བའི་རྩ་བ་འདིས་བདག་དང་སེམས་ཅན་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་གྱུར་ཅིག །ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱང་ཐོབ་པར་གྱུར་ཅིག །ཇི་ལྟར་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེས་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་བཞུགས་ཏེ། སངས་རྒྱས་ཀྱི་ཏིང་ངེ་འཛིན་བསམ་གྱིས་མི་ཁྱབ་པ་དྲི་མ་མེད་པ་ཤིན་ཏུ་དཀར་བ་ལ་བཞུགས་ནས་བདུད་སྡིག་ཅན་བཅོམ་སྟེ། ཤེས་པར་བགྱི་བ་དང་།
en: “ ‘Through this root of merit may I and all beings attain the highest, most complete enlightenment of buddhahood and may we attain omniscient wisdom.

source: བལྟ་བར་བགྱི་བ་དང་། རྟོགས་པར་བགྱི་བ་དང་། མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་བགྱི་བ་གང་ཅི་ཡང་རུང་སྟེ། དེ་ཐམས་ཅད་ནམ་གྱི་ཐོ་རངས་སྐྱ་རེངས་འཆར་ཀར་སྐད་ཅིག་གཅིག་དང་ལྡན་པའི་ཤེས་རབ་ཀྱིས་བདུད་རྩི་བརྙེས་ཏེ། འཆི་བ་མེད་པར་འགྲོ་བའི་ལམ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེ་བཞིན་དུ་བདག་དང་སེམས་ཅན་ཐམས་ཅད་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་གྱུར་ཅིག །
en: Just as the Bhagavat Tathāgata Śākyamuni sat upon the Bodhimaṇḍa; remained in the inconceivable, stainless, and extremely difficult samādhi of buddhahood; defeated evil Māra; and at dawn obtained the amṛta of wisdom that in an instant had all knowledge, had the view, had realization, had complete enlightenment, and had gained the buddhahood of the path to deathlessness, in that same way may I and all beings attain the highest, most complete enlightenment of buddhahood.

source: ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱང་ཐོབ་པར་གྱུར་ཅིག །ཇི་ལྟར་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འོད་དཔག་མེད་དང་། འོད་མཆོག་དང་། འོད་དགེ་དང་། བསོད་ནམས་འོད་དང་། མི་འཁྲུགས་པ་དང་། སེང་གེ་དང་། འོད་ཟེར་བརྒྱ་པ་དང་། འོད་ཟེར་མཐོ་དང་། འོད་དྲ་བ་ཅན་དང་། རིན་ཆེན་འོད་འཕྲོ་དང་། འོད་འབར་དང་། སྣང་བའི་རྒྱལ་པོ་དང་། ཤིན་དུ་བརྒྱན་དང་། རིན་ཆེན་ཏོག་དང་། ཆོས་ཀྱི་རྒྱལ་མཚན་དང་། ཡན་ལག་མཆོག་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་དང་། སངས་རྒྱས་བཅོམ་ལྡན་འདས་གཞན་དག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཇི་ཙམ་དུ་སྐྱེ་བོ་མང་པོ་ལ་སྨན་པ་དང་། སྐྱེ་བ་མང་པོ་ལ་བདེ་བ་དང་། འཇིག་རྟེན་ལ་ཐུགས་བརྩེ་བ་དང་། སྐྱེ་བོ་ཕལ་པོ་ཆེ་དང་། ལྷ་དང་། མི་རྣམས་ཀྱི་དོན་དང་། སྨན་པ་དང་།
en: May we attain omniscient wisdom.

source: བདེ་བའི་སླད་དུ་ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་བ་དེ་བཞིན་དུ་བདག་དང་སེམས་ཅན་ཐམས་ཅད་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་སྐྱེ་བོ་མང་པོ་ལ་སྨན་པ་དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བ་དང་། འཇིག་རྟེན་ལ་ཐུགས་བརྩེ་བ་དང་། སྐྱེ་བ་ཕལ་པོ་ཆེ་དང་། ལྷ་དང་། མི་རྣམས་ཀྱི་དོན་དང་། སྨན་པ་དང་། བདེ་བའི་སླད་དུ་ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་སྐོར་བར་ཤོག་ཤིག་ཅེས་བརྗོད་པར་བྱའོ། །
en: “ ‘Just as the tathāgata arhat samyaksaṃbuddhas, including the Bhagavat Tathāgata Amitābha, Varaprabha, Virtue of Light, Puṇyaprabha, Akṣobhya, Siṃha, Śatakiraṇa, Exalted Light Rays, Net of Light, Ratnārci, Prabhājvala, King of Illumination, Vibhūṣita, Ratnaketu, Dharmadhvaja, and Varāṅga, and other buddha bhagavats who attained the highest, most complete enlightenment of buddhahood, turned the wheel of the Dharma for the sake of benefit for many beings, for the happiness of many beings, out of compassion for the world, and for the welfare, benefit, and happiness of multitudes of beings, devas and humans, in the same way may I and all beings attain the highest, most complete enlightenment of buddhahood and turn the wheel of the Dharma for the sake of benefit for many beings, for the happiness of many beings, out of compassion for the world, and for the welfare, benefit, and happiness of multitudes of beings, devas and humans.’

source: ཤཱ་རིའི་བུ་འདི་ནི་ཡོངས་སུ་བསྔོ་བའི་ཕུང་པོ་སྟེ།
en: “Śāriputra, that is the accumulation of dedication.

source: བསོད་ནམས་ཀྱི་ཕུང་པོ་སྔ་མས་ཡོངས་སུ་བསྔོ་བའི་ཕུང་པོ་འདིའི་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོ་བ་ནས་དཔེའི་བར་དུ་ཡང་མི་བཟོད་དོ། །ཤཱ་རིའི་བུ་རིགས་ཀྱི་བུའམ།
en: The previous accumulations of merit cannot approach the vastness of this accumulation of dedication and cannot even serve as an analogy for it.

source: རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་མདོ་འདི་ལེན་ཏམ། ཀུན་ཆུབ་པར་བྱེད་དམ། འཛིན་ཏམ། ཀློག་གམ། གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་སྟོན་ན་དེ་ནི་བསོད་ནམས་ཀྱི་ཕུང་པོ་དེ་བས་ཆེས་མང་དུ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་སྐྱེད་དོ། །
en: “Śāriputra, a noble son or noble daughter who obtains this sūtra, learns it, possesses it, reads it, and teaches it widely to others will develop an even greater, incalculable, measureless accumulation of merit.

source: ཤཱ་རིའི་བུ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་སྔ་ཕྱི་མེད་པར་མིའི་ལུས་ཐོབ་པར་གྱུར་ལ། སྔ་ཕྱི་མེད་པར་མིའི་ལུས་ཐོབ་ནས་ཀྱང་རང་བྱང་ཆུབ་ཐོབ་པར་གྱུར་ཏེ། དེ་དག་ལ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་ལ་ལ་ཞིག་གིས་བསྟི་སྟང་དང་། ཕུ་དུད་དུ་བྱ་བའི་ཕྱིར་གོས་དང་། ཟས་དང་། མལ་ཆ་དང་། ན་བའི་གསོས་སྨན་དང་། ཡོ་བྱད་རྣམས་ཀྱིས་ཇི་སྲིད་འཚོའི་བར་དུ་བསྙེན་བཀུར་བྱས་ཏེ། རིམ་གྲོ་བྱ་བ་ལན་ཅིག་ཅིང་ཡང་རིན་པོ་ཆེའི་ཕུང་པོ་རི་རབ་ཙམ་གྱི་རིན་པོ་ཆེ་རྣམས་ཡོངས་སུ་ཟད་པར་བྱས་ལ། ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་ཀྱང་དེ་དག་གི་མཆོད་རྟེན་རིན་པོ་ཆེ་སྣ་བདུན་ཏེ། གསེར་དང་། དངུལ་དང་། མུ་ཏིག་དང་། བཻ་དཱུརྱ་དང་། ཤེལ་དང་། སྤུག་དང་། མུ་ཏིག་དམར་པོ་ལས་འཕང་དུ་དཔག་ཚད་བཅུ་པ་བྱས་ཏེ། དེ་དག་ལ་གདུགས་དང་།
en: “Śāriputra, if all the past and future beings that are in a trichiliocosm world realm were to attain human bodies, and having gained human bodies, without distinction between past and future, were to each attain enlightenment, and if a noble son or noble daughter were to serve them throughout their lives with robes, food, bedding, medicine when ill, and requisites in order to honor them and revere them; and if they were to spend a heap of jewels the size of Sumeru each time they attended them; and if, when they had passed into nirvāṇa, they were to create stūpas for them ten yojanas high and made of the seven precious materials—gold, silver, pearls, beryl, crystal, white coral, and red pearls—and then make offerings to them with parasols, banners, flags, and streamers, then, Śāriputra, what do you think?

source: རྒྱལ་མཚན་དང་། བ་དན་དང་། བ་དན་ཕྲ་མོ་རྣམས་ཀྱིས་མཆོད་པ་བྱས་ན་ཤཱ་རིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གཞི་དེ་ལས་བསོད་ནམས་མང་དུ་སྐྱེད་དམ།
en: Would that noble son or noble daughter generate much merit upon that basis?”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་མང་ལགས་སོ། །
en: “Bhagavat, there would be much,” replied Śāriputra.

source: བདེ་བར་གཤེགས་པ་མང་ལགས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤཱ་རིའི་བུ་རིགས་ཀྱི་བུའམ།
en: “Sugata, there would be much.”

source: རིགས་ཀྱི་བུ་མོ་གང་མདོ་འདི་འཛིན་ཏམ། ཀུན་ཆུབ་པར་བྱེད་དམ། འདོན་པར་བྱེད་དམ། ཀློག་གམ། སྐྱེ་བོ་མང་པོ་ལ་ཡང་དག་པར་རབ་ཏུ་སྟོན་ཏམ།
en: “Śāriputra,” continued the Bhagavat, “a noble son or noble daughter who possesses this sūtra, learns it, recites it, reads it, teaches it to many people, and prays for the highest, most complete enlightenment will generate even greater merit.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སྨོན་ལམ་འདེབས་ན་དེ་ནི་དེ་བས་བསོད་ནམས་ཆེས་མང་དུ་སྐྱེད་དེ། བསོད་ནམས་ཀྱི་ཕུང་པོ་སྔ་མས་བསོད་ནམས་ཀྱི་ཕུང་པོ་འདིའི་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོ་བ་ནས་དཔེའི་བར་དུ་ཡང་མི་བཟོད་དོ། །
en: The previous accumulations of merit cannot approach the vastness of this accumulation of merit; they cannot even serve as an analogy for it.

source: ཤཱ་རིའི་བུ་འདི་ལྟར་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་སྒྲུབ་པ་འདི་ལ་གནས་ནས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བར་བསྐུལ་བའི་ཕྱིར་རོ། །
en: Śāriputra, it is because a noble son or noble daughter who is established in this practice requests the buddha bhagavats in the world realms in the ten directions to turn the wheel of the Dharma.

source: ཤཱ་རིའི་བུ་སྦྱིན་པ་རྣམས་ཀྱི་ནང་ན་ནི་འདི་ལྟ་སྟེ། ཆོས་ཀྱི་སྦྱིན་པ་ནི་མཆོག་ཅེས་ངས་བཤད་དོ། །
en: “Śāriputra, I have taught that the giving of the Dharma is the supreme act of generosity.”

source: དེ་ནས་འཁོར་དེ་ལས་སྲོག་ཆགས་ཁྲི་སྟན་ལས་ལངས་ཏེ། སོ་སོ་ནས་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then ten thousand beings within that assembly rose from their seats, and with their upper robes over one shoulder, knelt on their right knees, placed their palms together in homage, and bowed toward the Bhagavat.

source: བཅོམ་ལྡན་འདས་བདག་ཅག་གིས་མདོ་སྡེ་འདི་གཟུང་བར་བགྱིའོ། །
en: They said to the Bhagavat, “Bhagavat, we will possess this sūtra.

source: གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་ཡང་དག་པར་བསྟན་པར་བགྱིའོ། །
en: We will teach it widely to others.

source: བསྒྲུབ་པ་ལ་གནས་པར་བགྱིའོ། །
en: We will maintain its practice.

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: Why is that?

source: བཅོམ་ལྡན་འདས་བདག་ཅག་ནི་དགེ་བའི་ཆོས་དེ་ལྟ་བུ་དག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འཚལ་ཞིང་དོན་དུ་གཉེར་བ་ལགས་སོ། །
en: Bhagavat, it is because we are intent upon attaining the highest, most complete enlightenment of buddhahood through that kind of virtuous Dharma.”

source: དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་བཅོམ་ལྡན་འདས་དང་། ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་ལྷའི་མེ་ཏོག་མན་དཱ་ར་བས་མངོན་པར་གཏོར་ཏོ། །
en: Then Śakra, the lord of the devas, cast coral tree flowers over the Bhagavat and this Dharma teaching.

source: མངོན་པར་གཏོར་ནས་ཀྱང་ཚིག་འདི་སྐད་ཅེས་བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དགེ་བའི་རྩ་བ་བསྐྲུན་པ་དང་། ལས་ཀྱི་སྒྲིབ་པ་རྒྱུན་གཅོད་པའི་གཅེས་སྤྲས་བགྱིད་པ་ལགས་སོ། །
en: Having scattered them, he said, “Bhagavat, this is a greatly cherished Dharma teaching that creates the roots of merit for bodhisattvas and ends the continuity of the obscuration of karma.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དེ་དེ་བཞིན་ནོ། །ཀཽ་ཤི་ཀ་དེ་དེ་བཞིན་ཏེ།
en: “It is like that, Kauśika, it is like that,” said the Bhagavat.

source: ལྷའི་དབང་པོ་ངས་མངོན་པར་ཤེས་ཏེ། འདི་ནས་བསྐལ་པ་གྲངས་མེད་པའི་ཡང་ཆེས་གྲངས་མེད་པར་གྱུར་པ་ན་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་ཟེར་གྱི་ཕུང་པོ་ཆེན་པོ་ཞེས་བྱ་བ་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁོ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ།
en: Lord of devas, I remember that innumerable eons beyond innumerable eons in the past, there appeared in the world a tathāgata arhat samyaksaṃbuddha, one with wisdom and pure conduct, a sugata, a knower of the world, an unsurpassable guide who tamed beings, a teacher of gods and humans, a buddha, a bhagavat named Mahāraśmiskandha.

source: ལྷ་དང་། མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འཇིག་རྟེན་དུ་བྱུང་ངོ་། །ལྷའི་དབང་པོ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་ཟེར་གྱི་ཕུང་པོ་ཆེན་པོ་དེའི་ཚེའི་ཚད་ནི་ལོ་བྱེ་བ་ཕྲག་དྲུག་ཅུ་ཐུབ་པར་གྱུར་ཏོ། །
en: “Lord of devas, the lifespan of the tathāgata arhat samyaksaṃbuddha Mahāraśmiskandha was six hundred million years.

source: དེའི་ཉན་ཐོས་ཐོག་མར་འདུས་པ་ནི་བྱེ་བ་ཕྲག་འབུམ་ཡོད་དེ། ཐམས་ཅད་ཀྱང་དགྲ་བཅོམ་པ་ཟག་པ་ཟད་པ་ཤ་སྟག་གོ། །
en: His first assembly of śrāvakas numbered a trillion, and they were all arhats whose outflows had ceased.

source: དེའི་ཉན་ཐོས་འདུས་པ་གཉིས་པ་ནི་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་བརྒྱད་ཡོད་དེ། ཐམས་ཅད་ཀྱང་དགྲ་བཅོམ་པ་ཟག་པ་ཟད་པ་ཤ་སྟག་གོ། །
en: His second assembly of śrāvakas numbered ninety-eight trillion and they were all arhats whose outflows had ceased.

source: དེའི་ཉན་ཐོས་འདུས་པ་གསུམ་པ་ནི་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་དགུ་ཡོད་དེ། ཐམས་ཅད་ཀྱང་དགྲ་བཅོམ་པ་ཟག་པ་ཟད་པ་ཤ་སྟག་གོ། །
en: His third assembly of śrāvakas numbered ninety-nine trillion and they were all arhats whose outflows had ceased.

source: ལྷའི་དབང་པོ་དེ་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་ཟེར་གྱི་ཕུང་པོ་ཆེན་པོ་དེ་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་དང་། ཚངས་པ་དང་བཅས་པ་དང་། དགེ་སྦྱོང་དང་། བྲམ་ཟེར་བཅས་པའི་སྐྱེ་དགུའི་དོན་གྱི་ཕྱིར་རྒྱུའོ། །
en: “Lord of devas, the tathāgata arhat samyaksaṃbuddha Mahāraśmiskandha was active in order to benefit beings of the world with its devas, with its Brahmā, and with its mendicants and brahmins.

source: ལྷའི་དབང་པོ་དེའི་ཚེ་བུད་མེད་གང་གཱའི་ལྷ་མོ་ཞེས་བྱ་བ་ཞིག་འཁོར་འདུས་པ་དེ་ཉིད་ཀྱི་ནང་དུ་འདུས་པར་གྱུར་ཏེ། འདུག་པ་དེས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་གྱི་ཕུང་པོ་ཆེན་པོ་ལས་མངོན་སུམ་དུ་བཟུང་།
en: “Lord of devas, at that time, the female Gaṅgadevī entered the gathered assembly of his followers, and present there she obtained from the Tathāgata Mahāraśmiskandha this Dharma teaching.

source: ཀུན་ཆུབ་པར་བྱས། བླངས་ནས་སྐྱེ་བོ་མང་པོ་ལ་ཡང་དག་པར་བསྟན་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་ཡང་དག་པར་ཞུགས་པར་གྱུར་ཏོ། །
en: She learned it and, having acquired it, taught it to many beings, and set forth toward the highest, most complete enlightenment.

source: དེ་དེ་ནས་ཤི་འཕོས་ནས་བུད་མེད་ཀྱི་ལུས་སྤངས་ཏེ། སྐྱེས་པའི་དབང་པོ་ཐོབ་ནས་རྟག་པར་རྒྱུན་དུ་ལྷ་དང་། མི་རྣམས་ཀྱི་ནང་དུ་སྐྱེས་ཏེ། ལན་བརྒྱད་ཁྲི་བཞི་སྟོང་དུ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་བྱས་ནས་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་འོད་འཕྲོ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: When she passed away, she left behind a female body and obtained a male’s faculties and was always thereafter reborn among devas or humans, became a cakravartin king eighty-four thousand times, and then became the Tathāgata Ratnārci.

source: ཀཽ་ཤི་ཀ་འདི་ནས་ཤར་ཕྱོགས་ན་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་སྟོང་ཕྲག་བརྒྱ་ན་ཆོས་སྟོན་ཏེ། ངས་ད་ལྟ་ན་ཡང་མཐོང་ངོ་། །
en: “Kauśika, even now I see him teaching the Dharma in the east in a trillion buddha realms.

source: ཀཽ་ཤི་ཀ་སུ་དག་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་འོད་འཕྲོ་དེའི་མིང་ཐོས་པ་དེ་དག་ཐམས་ཅད་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་ངེས་པར་འགྱུར་རོ། །
en: “Kauśika, anyone who hears the name of the tathāgata arhat samyaksaṃbuddha Ratnārci will definitely pass into nirvāṇa.

source: བུད་མེད་གང་ལ་ལ་ཞིག་གིས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་འོད་འཕྲོ་དེའི་མིང་ཐོས་སམ། འཆི་ཀར་ཡང་མངོན་སུམ་དུ་བྱེད་ན་དེ་ཉིད་དེའི་བུད་མེད་ཀྱི་ལུས་ཀྱི་ཐ་མ་ཡིན་ནོ། །
en: Any woman who hears the name of the tathāgata arhat samyaksaṃbuddha Ratnārci, or perceives him at the time of death, will have been in her last female existence.

source: ལྷའི་དབང་པོ་དེ་ལྟར་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་དགེ་བའི་རྩ་བ་སྒྲུབ་པ་དང་། ལས་ཀྱི་སྒྲིབ་པ་རྒྱུན་གཅོད་པའི་གཅེས་སྤྲས་བྱེད་པ་ཡིན་ནོ། །
en: “Lord of devas, thus this Dharma teaching is the accomplishment of the good roots of bodhisattvas and mahāsattvas, and the cherishing of the ending of karma’s obscurations.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདིའི་མིང་ཅི་ལགས། འདི་ཇི་ལྟར་གཟུང་བར་བགྱི། དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: Then Śakra, the lord of devas, asked the Bhagavat, “What is the name of this Dharma teaching and how should we keep it?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཀཽ་ཤི་ཀ་དེའི་ཕྱིར་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལས་ཀྱི་སྒྲིབ་པ་རྒྱུན་གཅོད་པ་ཞེས་བྱ་བར་ཟུང་ཤིག །
en: The Bhagavat said to Śakra, the lord of devas, “Kauśika, you should keep this Dharma teaching as Putting an End to Karmic Obscurations.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཅེས་བྱ་བར་ཡང་ཟུང་ཤིག །
en: Keep it as The Bodhisattva Piṭaka.

source: འདི་སོམ་ཉི་གཅོད་པ་ཞེས་བྱ་བར་ཡང་ཟུང་ཤིག །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས།
en: Also keep it as The Ending of Doubt.”

source: ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དང་། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་དང་། ལྷ་དང་མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ། །
en: When the Bhagavat had said those words, Śakra, the lord of devas, Venerable Śāriputra, and the world with its devas, humans, asuras, and gandharvas rejoiced and praised the words of the Bhagavat.

source: འཕགས་པ་ལས་ཀྱི་སྒྲིབ་པ་རྒྱུན་གཅོད་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སོ།། །།
en: The Noble Mahāyāna Sūtra “Putting an End to Karmic Obscurations” is concluded.

source: རྒྱ་གར་གྱི་མཁན་པོ་ཛི་ན་མི་ཏྲ་དང་། དཱ་ན་ཤཱི་ལ་དང་། ཞུ་ཆེན་གྱི་ལོཙྪ་བ་བན་དེ་ཡེ་ཤེས་སྡེས་བསྒྱུར་ཅིང་ཞུས་ཏེ། སྐད་གསར་ཆད་ཀྱིས་བཅོས་ཤིང་གཏན་ལ་ཕབ་པ།​། །
en: Translated and revised by the upādhyāyas Jinamitra and Dānaśīla, and by the lotsawa Yeshé Dé, the chief editor, and definitively revised according to the new language reform.
